Revit 2027 API
IFCData.CreateBooleanOfType Method
 Creates a boolean data object of the specified type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateBooleanOfType(
	bool value,
	string typeName
)
Public Shared Function CreateBooleanOfType (
	value As Boolean,
	typeName As String
) As IFCData
public:
static IFCData^ CreateBooleanOfType(
	bool value,
	String^ typeName
)
static member CreateBooleanOfType :
        value : bool *
        typeName : string -> IFCData
Parameters
value Boolean
 The boolean value.
typeName String
 The type name.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace